optimisation_code/IWO_CFD_orig/0/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

top
{
    type slip;
}
bottom
{
    type slip;
}

front
{
    type empty;
}

back
{
    type empty;
}

// ************************************************************************* //
