optimisation_code/IWO_CFD_orig/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       8820;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       8850;
    }
    top
    {
        type            patch;
        nFaces          150;
        startFace       8880;
    }
    bottom
    {
        type            patch;
        nFaces          150;
        startFace       9030;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4500;
        startFace       9180;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4500;
        startFace       13680;
    }
)

// ************************************************************************* //
