optimisation_code/IWO_CFD_orig/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/Dimensions" 

//#codeStream;

convertToMeters 1;

vertices
(
    ($Xmin          $Y1         $Z1) //0
    ($Xmax          $Y1         $Z1) //1
    ($Xmax          $Y          $Z1) //2
    ($Xmin          $Y          $Z1) //3

    ($Xmin          $Y1         $Z) //4
    ($Xmax          $Y1         $Z) //5
    ($Xmax          $Y          $Z) //6
    ($Xmin          $Y          $Z) //7   
);
//(40 24 1)
blocks
(
    hex (0 1 2 3 4 5 6 7) (150 30 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
);

boundary
(

    inlet 
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet 
    {
        type patch;
        faces
        (
            (2 6 5 1)

        );
    }

    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
	    (1 5 4 0)
        );
    }

    front
    {
        type empty;
        faces
        (
	    (0 3 2 1)
        );
    }
    back
    {
        type empty;
        faces
        (
	    (4 5 6 7)
        );
    }
);

mergePatchPairs
(

);

// ************************************************************************* //
